HELLO = """
Добрый день!
Меня зовут Николай и это мое резюме в качестве кандидата на работу.
"""

HELP = """
Для просмотра информации выберите категорию данных и введите соотвествующий порядковый номер:
1 - Образование
2 - Опыт работы
3 - HARD skills
4 - SOFT skills
5 - Другая информация
6 - Мои контакты
------------------------------
help - Список доступных данных
exit - Выход
"""

BAD_COMMAND = "Неверная команда. Для списка доступных команд наберите 'help':"

END_MSG = """   
Ожидание ввода..."""

HARD_SKILLS = """
Hard skills:
- Опыт разработки на Python (фриланс: парсинг сайтов, разработка торгового бота для криптовалютной
биржи, различные teleram боты. Немного знаком с Django;
- Опыт работы с базами данных (MariaDB, PostgreSQL, SQLite, MongoDB);
- Опыт написания программ на Java, Kotlin (в том числе прохождение обучения на JetBrains Academy);
- Docker;
- Github;
- Linux;
- Pascal;
- VBS;
- Базовые знания HTML.
"""
SOFT_SKILLS = """
Soft skills:
- Умею разбираться не только в своем коде, но и в чужом;
- Пишу простой и читаемый код с комментариями;
- Тестирую самостоятельно;
- Могу достаточно быстро найти и пофиксить баги в коде.
"""
EDUCATION = """
Образование:
сентябрь 2009 - июль 2014
Национальный Исследовательский Томский Политехнический университет, г. Томск
Факультет: Инстутит Кибернетики
Специальность: Автоматизация технологических процессов и производств (в нефтегазовой отрасли)
Средний балл 4,85 (с отличием)
   
сентябрь 2019
Московский центр обучения Yokogawa, г. Москва - РСУ Centum VP R6. Инженерный курс
   
Самостоятельное изучения языков программирования Python, Java, Kotlin на online курсах
"""
EXPERIENCE = """
Опыт работы:
апрель 2014 - Настоящее время
ООО "Синтек", г. Томск - ведущий инженер программист по АСУТП
В мои обязанности входит разработка и внедрение программного обеспечения промышленных контроллеров.
Проведение пуско-наладочных работ. Есть большой опыт работы с промышленными контроллерами Schneider Electric,
Prosoft Systems, Yokogawa, а также со SCADA системами iFix, Alpha. Мной разработано и успешно запущено 
в работу около 15 систем обеспечивающих работу нефтеных магистральных насосных станций, Московского метрополитена.
   
Также есть небольшой опыт работы на фрилансе и приложений для личного пользования. 
Это разработка различных telegram ботов, парсинг сайтов, разработка бота для автоматической торговли 
на криптовалютной биржи. Есть небольшой опыт работы Django.
"""

ABOUT = """
Меня зовут Николай и мне 32 года. Последние 9 лет я работаю инженером программистом. 
Моей основной задачей является разработка различных алгоритмов и написание программы для бесперебойной работы 
автоматизированных систем управления и мониторинга. Основные проекты связаны с перекачкой нефти и нефтепродуктов
магистральных насосных станций, системами вентиляции, энергоснабжения и освещения метрополитена. 
В период ковидных ограничений заинтересовался программированием на Java, а затем и на Python, понял что хочу 
в дальнейшем сменить род деятельности на работу связанную с выполнением проектов на этих языках программирования.
В свободное время занимаюсь спортом, в основном летом это кросс-кантри (велосипед), зимой - горные лыжи.
"""